/*-------------------------------------------------------------------<Header>-
 Name: ex_04.cpp
 Title: —
 Description: Напишите программу, которая сохраняет текущее состояние флагов
 формата, устанавливает флаги showbase и hex, выводит на экран значение 100,
 а затем возвращает флаги в исходное состояние.
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}