/*-------------------------------------------------------------------<Header>-
 Name: ex_08.cpp
 Title: —
 Description: Составьте инструкцию для вывода числа 100 в шестнадцатеричной
 системе счисления с отображением основания системы счисления (0x).
 Для выполнения задания воспользуйтесь манипулятором setiosflags().
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}