/*-------------------------------------------------------------------<Header>-
 Name: ex_05.cpp
 Title: —
 Description: Разработайте программу для печати таблицы натуральных и десятичных
 логарифмов чисел от 2 до 100. Формат таблицы следующий: правое выравнивание,
 ширина поля — 10 символов, точность — 5 десятичных позиций.
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}