/*-------------------------------------------------------------------<Header>-
 Name: ex_02.cpp
 Title: —
 Description:  Напишите программу, которая бы устанавливала флаги для потока
 cout так, чтобы целые, если они положительны, выводились со знаком +.
 Покажите, что ваш набор флагов формата правилен.
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}