/*-------------------------------------------------------------------<Header>-
 Name: ex_01.cpp
 Title: —
 Description: Создайте иерархию классов для хранения информации о летательных
 аппаратах. Начните с общего базового класса Airship, предназначенного для
 хранения количества перевозимых пассажиров и количества перевозимого груза в
 фунтах или килограммах, или тоннах. Затем создайте два производных от Airship
 класса Airplane и Balloon (дирижабль). Класс Airplane должен хранить тип
 самолетного двигателя (винтовой или реактивный) и дальность полета в милях или
 километрах. Класс Balloon должен хранить информацию о типе газа, используемого
 для подъема дирижабля (водород или гелий), и его максимальный потолок (в футах
 или метрах). Создайте программу для демонстрации работы этой иерархии классов.
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}