/*-------------------------------------------------------------------<Header>-
 Name: ex_20.cpp
 Title: —
 Description: Напишите программу с классом watch, который бы играл роль обычных
 часов. Используя стандартные функции времени, создайте конструктор класса,
 который должен считывать и запоминать системное время. Для вывода этого времени
 на экран создайте пользовательскую функцию вывода.
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib> // system()

using namespace std;

int main() {

    system("pause");
    return 0;
}