/*-------------------------------------------------------------------<Header>-
 Name: ex_14.cpp
 Title: —
 Description: Напишите программу для вывода значения 1000.5364 в 20-символьном
 поле, с выравниванием влево, с двумя позициями после запятой и символом * в
 качестве символа заполнения. (Используйте флаги формата класса ios.)
 -------------------------------------------------------------------</Header>-*/

#include <iostream>
#include <cstdlib>

using namespace std;

int main() {
    cout.width(20);
    cout.setf(ios::left);
    cout.precision(6);
    cout.fill('*');
    cout << 1000.5364;
    cout << "\n\n";
    
     
    return 0;
}